Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase.Distance Property
 Gets the distance. The distance is measured in paper millimeters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Distance { get; }
Public ReadOnly Property Distance As Double
	Get
Property Value
Type: Double
See Also
Reference
CurvedDimensionSetBase Class
Tekla.Structures.Drawing Namespace